import { useEffect } from 'react';
import { useScrollContext } from '../../app/providers';

export const Rankings = () => {
  // const { unlockScroll } = useScrollContext();

  // useEffect(() => {
  //   unlockScroll();
  // }, []);
  return (
    <div>
      "Rankings"
      <div>
        У 2026 році розірвати шлюбний зв’язок можна буде швидко і без зайвої
        бюрократії, використавши застосунок "Дія". Про це повідомила
        прем’єр-міністр України Юлія Свириденко, передає УНН. Розлучитися можна
        буде швидко й онлайн. Послуга з’явиться в Дії у 2026 році та буде
        доступна для подружжя, яке не має неповнолітніх дітей. Такі зміни
        ухвалив сьогодні Кабінет Міністрів - повідомила Свириденко.
        Прем’єр-міністр нагадала, що раніше процедура вимагала кількох
        відвідувань ДРАЦС і паперових документів. Тепер, за її словами, цей
        процес стане простішим — без черг і без зайвих поїздок. Після подання
        заяви Дія автоматично перевірить інформацію в реєстрах, і через місяць
        шлюб буде розірвано. Протягом цього часу заяву можна відкликати.
        Свідоцтво про розірвання шлюбу ви теж отримаєте в застосунку - пояснила
        прем’єрка. Доповнення У судах України за перші шість місяців 2025 року
        розлучились щонайменше 38 671 пара - утричі більше, ніж через РАЦСи.
        Майже половина всіх судових розлучень припала на Дніпропетровську,
        Одеську, Харківську, Київську області та столицю. Найменше розлучень
        зафіксовано у Закарпатській та Волинській областях. У 2026 році
        розірвати шлюбний зв’язок можна буде швидко і без зайвої бюрократії,
        використавши застосунок "Дія". Про це повідомила прем’єр-міністр України
        Юлія Свириденко, передає УНН. Розлучитися можна буде швидко й онлайн.
        Послуга з’явиться в Дії у 2026 році та буде доступна для подружжя, яке
        не має неповнолітніх дітей. Такі зміни ухвалив сьогодні Кабінет
        Міністрів - повідомила Свириденко. Прем’єр-міністр нагадала, що раніше
        процедура вимагала кількох відвідувань ДРАЦС і паперових документів.
        Тепер, за її словами, цей процес стане простішим — без черг і без зайвих
        поїздок. Після подання заяви Дія автоматично перевірить інформацію в
        реєстрах, і через місяць шлюб буде розірвано. Протягом цього часу заяву
        можна відкликати. Свідоцтво про розірвання шлюбу ви теж отримаєте в
        застосунку - пояснила прем’єрка. Доповнення У судах України за перші
        шість місяців 2025 року розлучились щонайменше 38 671 пара - утричі
        більше, ніж через РАЦСи. Майже половина всіх судових розлучень припала
        на Дніпропетровську, Одеську, Харківську, Київську області та столицю.
        Найменше розлучень зафіксовано у Закарпатській та Волинській областях. У
        2026 році розірвати шлюбний зв’язок можна буде швидко і без зайвої
        бюрократії, використавши застосунок "Дія". Про це повідомила
        прем’єр-міністр України Юлія Свириденко, передає УНН. Розлучитися можна
        буде швидко й онлайн. Послуга з’явиться в Дії у 2026 році та буде
        доступна для подружжя, яке не має неповнолітніх дітей. Такі зміни
        ухвалив сьогодні Кабінет Міністрів - повідомила Свириденко.
        Прем’єр-міністр нагадала, що раніше процедура вимагала кількох
        відвідувань ДРАЦС і паперових документів. Тепер, за її словами, цей
        процес стане простішим — без черг і без зайвих поїздок. Після подання
        заяви Дія автоматично перевірить інформацію в реєстрах, і через місяць
        шлюб буде розірвано. Протягом цього часу заяву можна відкликати.
        Свідоцтво про розірвання шлюбу ви теж отримаєте в застосунку - пояснила
        прем’єрка. Доповнення У судах України за перші шість місяців 2025 року
        розлучились щонайменше 38 671 пара - утричі більше, ніж через РАЦСи.
        Майже половина всіх судових розлучень припала на Дніпропетровську,
        Одеську, Харківську, Київську області та столицю. Найменше розлучень
        зафіксовано у Закарпатській та Волинській областях. У 2026 році
        розірвати шлюбний зв’язок можна буде швидко і без зайвої бюрократії,
        використавши застосунок "Дія". Про це повідомила прем’єр-міністр України
        Юлія Свириденко, передає УНН. Розлучитися можна буде швидко й онлайн.
        Послуга з’явиться в Дії у 2026 році та буде доступна для подружжя, яке
        не має неповнолітніх дітей. Такі зміни ухвалив сьогодні Кабінет
        Міністрів - повідомила Свириденко. Прем’єр-міністр нагадала, що раніше
        процедура вимагала кількох відвідувань ДРАЦС і паперових документів.
        Тепер, за її словами, цей процес стане простішим — без черг і без зайвих
        поїздок. Після подання заяви Дія автоматично перевірить інформацію в
        реєстрах, і через місяць шлюб буде розірвано. Протягом цього часу заяву
        можна відкликати. Свідоцтво про розірвання шлюбу ви теж отримаєте в
        застосунку - пояснила прем’єрка. Доповнення У судах України за перші
        шість місяців 2025 року розлучились щонайменше 38 671 пара - утричі
        більше, ніж через РАЦСи. Майже половина всіх судових розлучень припала
        на Дніпропетровську, Одеську, Харківську, Київську області та столицю.
        Найменше розлучень зафіксовано у Закарпатській та Волинській областях. У
        2026 році розірвати шлюбний зв’язок можна буде швидко і без зайвої
        бюрократії, використавши застосунок "Дія". Про це повідомила
        прем’єр-міністр України Юлія Свириденко, передає УНН. Розлучитися можна
        буде швидко й онлайн. Послуга з’явиться в Дії у 2026 році та буде
        доступна для подружжя, яке не має неповнолітніх дітей. Такі зміни
        ухвалив сьогодні Кабінет Міністрів - повідомила Свириденко.
        Прем’єр-міністр нагадала, що раніше процедура вимагала кількох
        відвідувань ДРАЦС і паперових документів. Тепер, за її словами, цей
        процес стане простішим — без черг і без зайвих поїздок. Після подання
        заяви Дія автоматично перевірить інформацію в реєстрах, і через місяць
        шлюб буде розірвано. Протягом цього часу заяву можна відкликати.
        Свідоцтво про розірвання шлюбу ви теж отримаєте в застосунку - пояснила
        прем’єрка. Доповнення У судах України за перші шість місяців 2025 року
        розлучились щонайменше 38 671 пара - утричі більше, ніж через РАЦСи.
        Майже половина всіх судових розлучень припала на Дніпропетровську,
        Одеську, Харківську, Київську області та столицю. Найменше розлучень
        зафіксовано у Закарпатській та Волинській областях. У 2026 році
        розірвати шлюбний зв’язок можна буде швидко і без зайвої бюрократії,
        використавши застосунок "Дія". Про це повідомила прем’єр-міністр України
        Юлія Свириденко, передає УНН. Розлучитися можна буде швидко й онлайн.
        Послуга з’явиться в Дії у 2026 році та буде доступна для подружжя, яке
        не має неповнолітніх дітей. Такі зміни ухвалив сьогодні Кабінет
        Міністрів - повідомила Свириденко. Прем’єр-міністр нагадала, що раніше
        процедура вимагала кількох відвідувань ДРАЦС і паперових документів.
        Тепер, за її словами, цей процес стане простішим — без черг і без зайвих
        поїздок. Після подання заяви Дія автоматично перевірить інформацію в
        реєстрах, і через місяць шлюб буде розірвано. Протягом цього часу заяву
        можна відкликати. Свідоцтво про розірвання шлюбу ви теж отримаєте в
        застосунку - пояснила прем’єрка. Доповнення У судах України за перші
        шість місяців 2025 року розлучились щонайменше 38 671 пара - утричі
        більше, ніж через РАЦСи. Майже половина всіх судових розлучень припала
        на Дніпропетровську, Одеську, Харківську, Київську області та столицю.
        Найменше розлучень зафіксовано у Закарпатській та Волинській областях. У
        2026 році розірвати шлюбний зв’язок можна буде швидко і без зайвої
        бюрократії, використавши застосунок "Дія". Про це повідомила
        прем’єр-міністр України Юлія Свириденко, передає УНН. Розлучитися можна
        буде швидко й онлайн. Послуга з’явиться в Дії у 2026 році та буде
        доступна для подружжя, яке не має неповнолітніх дітей. Такі зміни
        ухвалив сьогодні Кабінет Міністрів - повідомила Свириденко.
        Прем’єр-міністр нагадала, що раніше процедура вимагала кількох
        відвідувань ДРАЦС і паперових документів. Тепер, за її словами, цей
        процес стане простішим — без черг і без зайвих поїздок. Після подання
        заяви Дія автоматично перевірить інформацію в реєстрах, і через місяць
        шлюб буде розірвано. Протягом цього часу заяву можна відкликати.
        Свідоцтво про розірвання шлюбу ви теж отримаєте в застосунку - пояснила
        прем’єрка. Доповнення У судах України за перші шість місяців 2025 року
        розлучились щонайменше 38 671 пара - утричі більше, ніж через РАЦСи.
        Майже половина всіх судових розлучень припала на Дніпропетровську,
        Одеську, Харківську, Київську області та столицю. Найменше розлучень
        зафіксовано у Закарпатській та Волинській областях. У 2026 році
        розірвати шлюбний зв’язок можна буде швидко і без зайвої бюрократії,
        використавши застосунок "Дія". Про це повідомила прем’єр-міністр України
        Юлія Свириденко, передає УНН. Розлучитися можна буде швидко й онлайн.
        Послуга з’явиться в Дії у 2026 році та буде доступна для подружжя, яке
        не має неповнолітніх дітей. Такі зміни ухвалив сьогодні Кабінет
        Міністрів - повідомила Свириденко. Прем’єр-міністр нагадала, що раніше
        процедура вимагала кількох відвідувань ДРАЦС і паперових документів.
        Тепер, за її словами, цей процес стане простішим — без черг і без зайвих
        поїздок. Після подання заяви Дія автоматично перевірить інформацію в
        реєстрах, і через місяць шлюб буде розірвано. Протягом цього часу заяву
        можна відкликати. Свідоцтво про розірвання шлюбу ви теж отримаєте в
        застосунку - пояснила прем’єрка. Доповнення У судах України за перші
        шість місяців 2025 року розлучились щонайменше 38 671 пара - утричі
        більше, ніж через РАЦСи. Майже половина всіх судових розлучень припала
        на Дніпропетровську, Одеську, Харківську, Київську області та столицю.
        Найменше розлучень зафіксовано у Закарпатській та Волинській областях. У
        2026 році розірвати шлюбний зв’язок можна буде швидко і без зайвої
        бюрократії, використавши застосунок "Дія". Про це повідомила
        прем’єр-міністр України Юлія Свириденко, передає УНН. Розлучитися можна
        буде швидко й онлайн. Послуга з’явиться в Дії у 2026 році та буде
        доступна для подружжя, яке не має неповнолітніх дітей. Такі зміни
        ухвалив сьогодні Кабінет Міністрів - повідомила Свириденко.
        Прем’єр-міністр нагадала, що раніше процедура вимагала кількох
        відвідувань ДРАЦС і паперових документів. Тепер, за її словами, цей
        процес стане простішим — без черг і без зайвих поїздок. Після подання
        заяви Дія автоматично перевірить інформацію в реєстрах, і через місяць
        шлюб буде розірвано. Протягом цього часу заяву можна відкликати.
        Свідоцтво про розірвання шлюбу ви теж отримаєте в застосунку - пояснила
        прем’єрка. Доповнення У судах України за перші шість місяців 2025 року
        розлучились щонайменше 38 671 пара - утричі більше, ніж через РАЦСи.
        Майже половина всіх судових розлучень припала на Дніпропетровську,
        Одеську, Харківську, Київську області та столицю. Найменше розлучень
        зафіксовано у Закарпатській та Волинській областях.
      </div>
    </div>
  );
};
